Revit 2026 API

# ConcreteConcreteBumpAmount Property

---

The property labeled "Amount" from the "Concrete" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string ConcreteBumpAmount { get; }
```
```vb
Public Shared ReadOnly Property ConcreteBumpAmount As String
	Get
```
```cpp
public:
static property String^ ConcreteBumpAmount {
	String^ get ();
}
```
```fsharp
static member ConcreteBumpAmount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 2".

#### Reference

Concrete Class

Autodesk.Revit.DB.Visual Namespace